src/Documents/ПеремещениеВозврата/ПеремещениеВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеВозврата</name>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>ТочкаРаздачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Списать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДниХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.ВозвратГруппОрганизатору</types>
        <types>DocumentRef.ВозвратПокупокОрганизатору</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Возвраты/Возвраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Возвраты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Участники</types>
      <types>CatalogRef.Организаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВозвратГруппОрганизатору</types>
      <types>DocumentRef.ВозвратПокупокОрганизатору</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ДвижениеТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПеремещениеВозврата/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Возвраты.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Покупки Цикл
		Движение 				= Движения.Возвраты.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Организатор 	= ТекСтрокаПокупки.Организатор;
		Движение.Участник 		= ТекСтрокаПокупки.Участник;
		Движение.Покупка 		= ТекСтрокаПокупки.Покупка;
		Движение.Количество 	= ТекСтрокаПокупки.Количество;
		Движение.МестоХранения 	= ТекСтрокаПокупки.МестоХранения;

		Движение.Партия 		= ТекСтрокаПокупки.Партия;
	КонецЦикла;

КонецПроцедуры
